![](https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Labs_Coursera_V5/labs/Lab%20-%20INSERT%20-%20UPDATE%20-%20DELETE/images/IDSNlogo.png)

# Hands-on Lab : CREATE, ALTER, TRUNCATE, DROP

**Estimated time needed:** 15 minutes

In this lab, you will learn some commonly used DDL (Data Definition Language) statements of SQL. First you will learn the CREATE statement, which is used to create a new table in a database. Next, you will learn the ALTER statement which is used to add, delete, or modify columns in an existing table. Then, you will learn the TRUNCATE statement which is used to remove all rows from an existing table without deleting the table itself. Lastly, you will learn the DROP statement which is used to delete an existing table in a database.

**How does the syntax of a CREATE statement look?**

```sql
CREATE TABLE table_name (
    column1 datatype,
    column2 datatype,
    column3 datatype,
   ....);
```

**How does the syntax of an ALTER statement look?**

```sql
ALTER TABLE table_name
ADD COLUMN column_name data_type column_constraint;

ALTER TABLE table_name
DROP COLUMN column_name;

ALTER TABLE table_name
ALTER COLUMN column_name SET DATA TYPE data_type;

ALTER TABLE table_name
RENAME COLUMN current_column_name TO new_column_name;
```

**How does the syntax of a TRUNCATE statement look?**

```sql
TRUNCATE TABLE table_name;
```

**How does the syntax of a DROP statement look?**

```sql
DROP TABLE table_name;
```

## Software Used in this Lab

In this lab, you will use [IBM Db2 Database](https://www.ibm.com/products/db2-database?utm_medium=Exinfluencer&utm_source=Exinfluencer&utm_content=000026UJ&utm_term=10006555&utm_id=NA-SkillsNetwork-Channel-SkillsNetworkCoursesIBMDeveloperSkillsNetworkDB0201ENSkillsNetwork20127838-2022-01-01). Db2 is a Relational Database Management System (RDBMS) from IBM, designed to store, analyze and retrieve the data efficiently.

To complete this lab you will utilize a Db2 database service on IBM Cloud. If you did not already complete this lab task earlier in this module, you will not yet have access to Db2 on IBM Cloud, and you will need to follow this lab first:

- [Hands-on Lab : Sign up for IBM Cloud, Create Db2 service instance and Get started with the Db2 console](https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Labs_Coursera_V5/labs/Lab%20-%20Sign%20up%20for%20IBM%20Cloud%20-%20Create%20Db2%20service%20instance%20-%20Get%20started%20with%20the%20Db2%20console/instructional-labs.md.html)

## Database Used in this Lab

The databases used in this lab are internal databases.

## Objectives

After completing this lab, you will be able to:

- Create a new table in a database
- Add, delete, or modify columns in an existing table
- Remove all rows from an existing table without deleting the table itself
- Delete an existing table in a database

## Instructions

When you approach the exercises in this lab, follow the instructions to run the queries on Db2:

- Go to the [Resource List](https://cloud.ibm.com/resources?utm_medium=Exinfluencer&utm_source=Exinfluencer&utm_content=000026UJ&utm_term=10006555&utm_id=NA-SkillsNetwork-Channel-SkillsNetworkCoursesIBMDeveloperSkillsNetworkDB0201ENSkillsNetwork20127838-2022-01-01) of IBM Cloud by logging in where you can find the Db2 service instance that you created in a previous lab under **Services** section. Click on the **Db2-xx service**. Next, open the Db2 Console by clicking on **Open Console** button. Click on the 3-bar menu icon in the top left corner and go to the **Run SQL** page. The Run SQL tool enables you to run SQL statements.

    - If needed, follow [Hands-on Lab : Sign up for IBM Cloud, Create Db2 service instance and Get started with the Db2 console](https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Labs_Coursera_V5/labs/Lab%20-%20Sign%20up%20for%20IBM%20Cloud%20-%20Create%20Db2%20service%20instance%20-%20Get%20started%20with%20the%20Db2%20console/instructional-labs.md.html)

In [25]:
import sqlite3
import pandas as pd

In [26]:
con = sqlite3.connect(":memory:")
cur = con.cursor()

# Exercise 1: CREATE

In this exercise, you will use the CREATE statement to create two new tables using Db2.

1. You need to create two tables, **PETSALE** and **PET**. To create the two tables PETSALE and PET, copy the code below and paste it to the textbox of the **Run SQL** page. Click **Run all**.

```sql
CREATE TABLE PETSALE (
    ID INTEGER NOT NULL,
    PET CHAR(20),
    SALEPRICE DECIMAL(6,2),
    PROFIT DECIMAL(6,2),
    SALEDATE DATE
    );
    
CREATE TABLE PET (
    ID INTEGER NOT NULL,
    ANIMAL VARCHAR(20),
    QUANTITY INTEGER
    );
```

![](https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Labs_Coursera_V5/labs/Lab%20-%20CREATE%20-%20ALTER%20-%20TRUNCATE%20-%20DROP/images/1.1.png)

2. Now insert some records into the two newly created tables and show all the records of the two tables. Copy the code below and paste it to the textbox of the **Run SQL** page. Click **Run all**.

```sql
INSERT INTO PETSALE VALUES
    (1,'Cat',450.09,100.47,'2018-05-29'),
    (2,'Dog',666.66,150.76,'2018-06-01'),
    (3,'Parrot',50.00,8.9,'2018-06-04'),
    (4,'Hamster',60.60,12,'2018-06-11'),
    (5,'Goldfish',48.48,3.5,'2018-06-14');
    
INSERT INTO PET VALUES
    (1,'Cat',3),
    (2,'Dog',4),
    (3,'Hamster',2);
    
SELECT * FROM PETSALE;
SELECT * FROM PET;
```

![](https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Labs_Coursera_V5/labs/Lab%20-%20CREATE%20-%20ALTER%20-%20TRUNCATE%20-%20DROP/images/1.2.png)

In [27]:
query = '''
            CREATE TABLE PETSALE (  ID INTEGER NOT NULL,
                                    PET CHAR(20),
                                    SALEPRICE DECIMAL(6, 2),
                                    PROFIT DECIMAL(6, 2),
                                    SALEDATE DATE);
        '''
cur.execute(query)

In [28]:
query = '''
            CREATE TABLE PET (  ID INTEGER NOT NULL,
                                ANIMAL VARCHAR(20),
                                QUANTITY INTEGER);
        '''
cur.execute(query)

In [29]:
query = '''
            INSERT INTO PETSALE 
            VALUES  (1,'Cat',450.09,100.47,'2018-05-29'),
                    (2,'Dog',666.66,150.76,'2018-06-01'),
                    (3,'Parrot',50.00,8.9,'2018-06-04'),
                    (4,'Hamster',60.60,12,'2018-06-11'),
                    (5,'Goldfish',48.48,3.5,'2018-06-14');
        '''
cur.execute(query)

In [30]:
query = '''
            INSERT INTO PET 
            VALUES  (1,'Cat',3),
                    (2,'Dog',4),
                    (3,'Hamster',2);
        '''
cur.execute(query)

In [31]:
query = '''
            SELECT *
            FROM PETSALE
        '''
df = pd.read_sql_query(query, con)
df

   ID       PET  SALEPRICE  PROFIT    SALEDATE
0   1       Cat     450.09  100.47  2018-05-29
1   2       Dog     666.66  150.76  2018-06-01
2   3    Parrot      50.00    8.90  2018-06-04
3   4   Hamster      60.60   12.00  2018-06-11
4   5  Goldfish      48.48    3.50  2018-06-14

In [32]:
query = '''
            SELECT *
            FROM PET
        '''
df = pd.read_sql_query(query, con)
df

   ID   ANIMAL  QUANTITY
0   1      Cat         3
1   2      Dog         4
2   3  Hamster         2

# Exercise 2: ALTER

In this exercise, you will use the ALTER statement to add, delete, or modify columns in two of the existing tables created in exercise 1.

## Task A: ALTER using ADD COLUMN

1. Add a new **QUANTITY** column to the **PETSALE** table and show the altered table. Copy the code below and paste it to the textbox of the **Run SQL** page. Click **Run all**.

```sql
ALTER TABLE PETSALE
ADD COLUMN QUANTITY INTEGER;

SELECT * FROM PETSALE;
```

![](https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Labs_Coursera_V5/labs/Lab%20-%20CREATE%20-%20ALTER%20-%20TRUNCATE%20-%20DROP/images/2.A.1.png)

2. Now update the newly added **QUANTITY** column of the **PETSALE** table with some values and show all the records of the table. Copy the code below and paste it to the textbox of the **Run SQL** page. Click **Run all**.

```sql
UPDATE PETSALE SET QUANTITY = 9 WHERE ID = 1;
UPDATE PETSALE SET QUANTITY = 3 WHERE ID = 2;
UPDATE PETSALE SET QUANTITY = 2 WHERE ID = 3;
UPDATE PETSALE SET QUANTITY = 6 WHERE ID = 4;
UPDATE PETSALE SET QUANTITY = 24 WHERE ID = 5;

SELECT * FROM PETSALE;
```

![](https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Labs_Coursera_V5/labs/Lab%20-%20CREATE%20-%20ALTER%20-%20TRUNCATE%20-%20DROP/images/2.A.2.png)

In [33]:
query = '''
            ALTER TABLE PETSALE
            ADD COLUMN QUANTITY INTEGER;
        '''
cur.execute(query)

In [34]:
query = '''
            SELECT *
            FROM PETSALE
        '''
df = pd.read_sql_query(query, con)
df

   ID       PET  SALEPRICE  PROFIT    SALEDATE QUANTITY
0   1       Cat     450.09  100.47  2018-05-29     None
1   2       Dog     666.66  150.76  2018-06-01     None
2   3    Parrot      50.00    8.90  2018-06-04     None
3   4   Hamster      60.60   12.00  2018-06-11     None
4   5  Goldfish      48.48    3.50  2018-06-14     None

In [35]:
quantities = [9, 3, 2, 6, 24]
ids = [1, 2, 3, 4, 5]

for quantity, id in list(zip(quantities, ids)):
   query =  '''
               UPDATE PETSALE 
               SET QUANTITY={} 
               WHERE ID={}
            '''.format(quantity, id)
   cur.execute(query)

In [36]:
query = '''
            SELECT *
            FROM PETSALE
        '''
df = pd.read_sql_query(query, con)
df

   ID       PET  SALEPRICE  PROFIT    SALEDATE  QUANTITY
0   1       Cat     450.09  100.47  2018-05-29         9
1   2       Dog     666.66  150.76  2018-06-01         3
2   3    Parrot      50.00    8.90  2018-06-04         2
3   4   Hamster      60.60   12.00  2018-06-11         6
4   5  Goldfish      48.48    3.50  2018-06-14        24

## Task B: ALTER using DROP COLUMN

1. Delete the **PROFIT** column from the **PETSALE** table and show the altered table. Copy the code below and paste it to the textbox of the **Run SQL** page. Click **Run all**.

```sql
ALTER TABLE PETSALE
DROP COLUMN PROFIT;

SELECT * FROM PETSALE;
```

![](https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Labs_Coursera_V5/labs/Lab%20-%20CREATE%20-%20ALTER%20-%20TRUNCATE%20-%20DROP/images/2.B.1.png)

In [37]:
query = '''
            ALTER TABLE PETSALE
            DROP COLUMN PROFIT;
        '''
cur.execute(query)

In [38]:
query = '''
            SELECT *
            FROM PETSALE
        '''
df = pd.read_sql_query(query, con)
df

   ID       PET  SALEPRICE    SALEDATE  QUANTITY
0   1       Cat     450.09  2018-05-29         9
1   2       Dog     666.66  2018-06-01         3
2   3    Parrot      50.00  2018-06-04         2
3   4   Hamster      60.60  2018-06-11         6
4   5  Goldfish      48.48  2018-06-14        24

## Task C: ALTER using ALTER COLUMN

1. Change the data type to **VARCHAR(20)** type of the column **PET** of the table **PETSALE** and show the altered table. Copy the code below and paste it to the textbox of the **Run SQL** page. Click **Run all**.

```sql
ALTER TABLE PETSALE
ALTER COLUMN PET SET DATA TYPE VARCHAR(20);

SELECT * FROM PETSALE;
```

![](https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Labs_Coursera_V5/labs/Lab%20-%20CREATE%20-%20ALTER%20-%20TRUNCATE%20-%20DROP/images/2.C.1.png)

2. Now verify if the data type of the column **PET** of the table **PETSALE** changed to **VARCHAR(20)** type or not. Click on the 3 bar menu icon in the top left corner and click **Explore > Tables**. Find the **PETSALE** table from Schemas by clicking **Select All**. Click on the **PETSALE** table to open the Table Definition page of the table. Here, you can see all the current data type of the columns of the **PETSALE** table.

![](https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Labs_Coursera_V5/labs/Lab%20-%20CREATE%20-%20ALTER%20-%20TRUNCATE%20-%20DROP/images/2.C.2.png)

In [39]:
# query = '''
#             ALTER TABLE PETSALE
#             ALTER COLUMN PET SET DATA TYPE VARCHAR(20);
#         '''
# cur.execute(query)

In [42]:
query = '''
            SELECT DISTINCT typeof(PET)
            FROM PETSALE
        '''
df = pd.read_sql_query(query, con)
df

  typeof(PET)
0        text

## Task D: ALTER using RENAME COLUMN

1. Rename the column **PET** to **ANIMAL** of the **PETSALE** table and show the altered table. Copy the code below and paste it to the textbox of the **Run SQL** page. Click **Run all**.

```sql
ALTER TABLE PETSALE
RENAME COLUMN PET TO ANIMAL;

SELECT * FROM PETSALE;
```

![](https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Labs_Coursera_V5/labs/Lab%20-%20CREATE%20-%20ALTER%20-%20TRUNCATE%20-%20DROP/images/2.D.1.png)

In [43]:
query = '''
            ALTER TABLE PETSALE
            RENAME COLUMN PET TO ANIMAL;
        '''
cur.execute(query)

In [44]:
query = '''
            SELECT *
            FROM PETSALE
        '''
df = pd.read_sql_query(query, con)
df

   ID    ANIMAL  SALEPRICE    SALEDATE  QUANTITY
0   1       Cat     450.09  2018-05-29         9
1   2       Dog     666.66  2018-06-01         3
2   3    Parrot      50.00  2018-06-04         2
3   4   Hamster      60.60  2018-06-11         6
4   5  Goldfish      48.48  2018-06-14        24

# Exercise 3: TRUNCATE

In this exercise, you will use the TRUNCATE statement to remove all rows from an existing table created in exercise 1 without deleting the table itself.

1. Remove all rows from the **PET** table and show the empty table. Copy the code below and paste it to the textbox of the **Run SQL** page. Click **Run all**.

```sql
TRUNCATE TABLE PET IMMEDIATE;

SELECT * FROM PET;
```

![](https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Labs_Coursera_V5/labs/Lab%20-%20CREATE%20-%20ALTER%20-%20TRUNCATE%20-%20DROP/images/3.1.png)

In [45]:
query = '''
            DELETE
            FROM PET;
        '''
cur.execute(query)

In [46]:
query = '''
            SELECT *
            FROM PET
        '''
df = pd.read_sql_query(query, con)
df

Empty DataFrame
Columns: [ID, ANIMAL, QUANTITY]
Index: []

# Exercise 4: DROP

In this exercise, you will use the DROP statement to delete an existing table created in exercise 1.

1. Delete the **PET** table and verify if the table still exists or not (SELECT statement won't work if a table doesn't exist). Copy the code below and paste it to the textbox of the **Run SQL** page. Click **Run all**.

```sql
DROP TABLE PET;

SELECT * FROM PET;
```

![](https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Labs_Coursera_V5/labs/Lab%20-%20CREATE%20-%20ALTER%20-%20TRUNCATE%20-%20DROP/images/4.1.png)

In [47]:
query = '''
            DROP TABLE PET
        '''
cur.execute(query)

In [48]:
query = '''
            SELECT *
            FROM PET
        '''
        
try: 
    df = pd.read_sql_query(query, con)
    df
except Exception as e: 
    print(e)

Execution failed on sql '
            SELECT *
            FROM PET
        ': no such table: PET

## Congratulations! You have completed this Lab. You are ready for the next topic.

In [49]:
con.close()

## Author(s)

- [Sandip Saha Joy](https://www.linkedin.com/in/sandipsahajoy/?utm_medium=Exinfluencer&utm_source=Exinfluencer&utm_content=000026UJ&utm_term=10006555&utm_id=NA-SkillsNetwork-Channel-SkillsNetworkCoursesIBMDeveloperSkillsNetworkDB0201ENSkillsNetwork20127838-2022-01-01)

## Other Contributor(s)

-

## Changelog

| Date              | Version | Changed By          | Change Description      |
| ----------------- | ------- | ------------------- | ----------------------- |
| 2020-12-24        | 1.1     | Steve Ryan          | ID Review               |
| 2020-12-07        | 1.0     | Sandip Saha Joy     | Initial version created |

## <h3 align="center"> Â© IBM Corporation 2020. All rights reserved. <h3/>